Revit 2027 API
ScheduleDefinition.GetField(ScheduleFieldId) Method
 Gets a field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleField GetField(
	ScheduleFieldId fieldId
)
Public Function GetField (
	fieldId As ScheduleFieldId
) As ScheduleField
public:
ScheduleField^ GetField(
	ScheduleFieldId^ fieldId
)
member GetField :
        fieldId : ScheduleFieldId -> ScheduleField
Parameters
fieldId ScheduleFieldId
 The ID of the field.
Return Value
ScheduleField
 The field.
Exceptions
Exception | Condition
ArgumentException |  fieldId is not the ID of a field in this ScheduleDefinition.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleDefinition Class
GetField Overload
Autodesk.Revit.DB Namespace